Revit 2027 API
PDFExportOptions.PaperOrientation Property
 Paper orientation - Portrait/Landscape/Auto
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PageOrientationType PaperOrientation { get; set; }
Public Property PaperOrientation As PageOrientationType
	Get
	Set
public:
property PageOrientationType PaperOrientation {
	PageOrientationType get ();
	void set (PageOrientationType value);
}
member PaperOrientation : PageOrientationType with get, set
Property Value
PageOrientationType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Remarks
 Ignored when the PaperFormat is ExportPaperFormat.Default, which means "Use Sheet Size".
See Also
Reference
PDFExportOptions Class
Autodesk.Revit.DB Namespace